# Pandas exercise 1

W pierwszych ćwiczenaich skorzystamy z Datasetu [Sallaries z Kaggle'a](https://www.kaggle.com/datasets/kaggle/sf-salaries)

Zadaniem ćwiczeń jest otrzymanie tych samych outputów które są w celach poniżej. Zadania będą zaczynały się od łatwiejszych i przechodzić będą do trudniejszych.

Pamiętaj, niektóre zadania można wykonać na więcej niż 1 sposób.

Tym czym będziemy sie zajmować na tych ćwiczeniach nazywa się ogólnie Exploratory Data Analysis (Badania eksploracyjne) i jest to wstępna analiza danych która obejmuje opis, wizualizację i badanie zebranych danych. Jest to podstawa badania do rozpoczęcia z każdym rodzajem danych. Ma ona na celu wzbogacenia wiedzy o hipotezy, które mogą nasunąć nieukierunkowana obserwacja i analizy. Każdy Data Scientis, osoba zajmująca się Big Data czy Machine Learningiem będzi korzystała z Exploratory Data Analysis.

## Exploratory Data Analysis

__Zaimportuj pandas jako pd (pandas as pd)__

In [1]:
import pandas as pd

__Wczytaj plik Salaries.csv do DataFrame__

In [2]:
DataFrame = pd.read_csv('Salaries.csv', delimiter=',')

__Sprawdź head twojego DataFrame__

In [6]:
DataFrame.head()

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.00,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN
1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,245131.88,137811.38,NaN,538909.28,538909.28,2011,NaN,San Francisco,NaN
2,3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739.13,106088.18,16452.60,NaN,335279.91,335279.91,2011,NaN,San Francisco,NaN
3,4,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916.00,56120.71,198306.90,NaN,332343.61,332343.61,2011,NaN,San Francisco,NaN
4,5,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134401.60,9737.00,182234.59,NaN,326373.19,326373.19,2011,NaN,San Francisco,NaN

In [4]:
DataFrame.head()

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.00,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN
1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,245131.88,137811.38,NaN,538909.28,538909.28,2011,NaN,San Francisco,NaN
2,3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739.13,106088.18,16452.60,NaN,335279.91,335279.91,2011,NaN,San Francisco,NaN
3,4,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916.00,56120.71,198306.90,NaN,332343.61,332343.61,2011,NaN,San Francisco,NaN
4,5,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134401.60,9737.00,182234.59,NaN,326373.19,326373.19,2011,NaN,San Francisco,NaN

__Sprawdź informacje o tym ile jest kolumn oraz wierszy w całym DataFrame (hint: info)__

In [7]:
DataFrame.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 148654 entries, 0 to 148653
Data columns (total 13 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   Id                148654 non-null  int64
 1   EmployeeName      148654 non-null  object
 2   JobTitle          148654 non-null  object
 3   BasePay           148045 non-null  float64
 4   OvertimePay       148650 non-null  float64
 5   OtherPay          148650 non-null  float64
 6   Benefits          112491 non-null  float64
 7   TotalPay          148654 non-null  float64
 8   TotalPayBenefits  148654 non-null  float64
 9   Year              148654 non-null  int64
 10  Notes             0 non-null       float64
 11  Agency            148654 non-null  object
 12  Status            0 non-null       float64
dtypes: float64(8), int64(2), object(3)
memory usage: 14.7+ MB

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 148654 entries, 0 to 148653
Data columns (total 13 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   Id                148654 non-null  int64
 1   EmployeeName      148654 non-null  object
 2   JobTitle          148654 non-null  object
 3   BasePay           148045 non-null  float64
 4   OvertimePay       148650 non-null  float64
 5   OtherPay          148650 non-null  float64
 6   Benefits          112491 non-null  float64
 7   TotalPay          148654 non-null  float64
 8   TotalPayBenefits  148654 non-null  float64
 9   Year              148654 non-null  int64
 10  Notes             0 non-null       float64
 11  Agency            148654 non-null  object
 12  Status            0 non-null       float64
dtypes: float64(8), int64(2), object(3)
memory usage: 14.7+ MB

__Jaka jest średnia BasePay?__

In [9]:
DataFrame['BasePay'].mean()

66325.4488404877

66325.4488404877

__Jaka jest najwyższa wartośc OvertimePay?__

In [11]:
DataFrame['OvertimePay'].max()

245131.88

245131.88

__Jaki jest tytuł zawodowy JOSEPH DRISCOLL?__

UWAGA: Szukamy JOSEPH DRISCOLL z dużych liter, jest to ważne ponieważ w naszych danych jest również ta sama osoba tylko pisana z małych liter.

In [14]:
DataFrame.loc[DataFrame['EmployeeName'] == 'JOSEPH DRISCOLL',['JobTitle']]

                     JobTitle
24  CAPTAIN, FIRE SUPPRESSION

In [26]:
DataFrame[DataFrame['EmployeeName'] == 'JOSEPH DRISCOLL']['JobTitle']

24    CAPTAIN, FIRE SUPPRESSION
Name: JobTitle, dtype: object

In [27]:
DataFrame[DataFrame['EmployeeName'] == 'JOSEPH DRISCOLL']['TotalPay']

24    270324.91
Name: TotalPay, dtype: float64

__Ile zarabia JOSEPH DRISCOLL razem z benefitami?__

In [16]:
DataFrame.loc[DataFrame['EmployeeName'] == 'JOSEPH DRISCOLL',['TotalPay']]

     TotalPay
24  270324.91

__Jak nazywa się osoba, która zarabia najwięcej razem z benefitami?__

In [28]:
DataFrame[DataFrame['TotalPay'] == DataFrame['TotalPay'].max()]['TotalPay']

0    567595.43
Name: TotalPay, dtype: float64

In [15]:
DataFrame.loc[DataFrame['EmployeeName'] == 'JOSEPH DRISCOLL',['TotalPay']]

     TotalPay
24  270324.91

In [23]:
DataFrame.loc[DataFrame['TotalPay'] == DataFrame['TotalPay'].max()]

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.0,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN

0    NATHANIEL FORD
Name: EmployeeName, dtype: object

__Jak nazywa się osoba, która zarabia najmniej razem z benefitami?__

In [25]:
DataFrame.loc[DataFrame['TotalPay'] == DataFrame['TotalPay'].min(), ['EmployeeName']]

       EmployeeName
148653    Joe Lopez

In [31]:
DataFrame[DataFrame['TotalPay'] == DataFrame['TotalPay'].min()]['EmployeeName']

148653    Joe Lopez
Name: EmployeeName, dtype: object

148653   -618.13
Name: TotalPay, dtype: float64

__Sprawdź ile zarabia osoba, która zarabia najmniej? Czy widzisz coś dziwnego?__

In [34]:
DataFrame[DataFrame['TotalPay'] == DataFrame['TotalPay'].min()]['TotalPay']

148653   -618.13
Name: TotalPay, dtype: float64

148653   -618.13
Name: TotalPayBenefits, dtype: float64

__Jaka jest średnia zarobków (BasePay) wszystkich pracowników per rok? (lata które tutaj są to 2011-2014)__

In [49]:
DataFrame.head()
DataFrame.groupby(['Year'])['BasePay'].mean()

Year
2011    63595.956517
2012    65436.406857
2013    69630.030216
2014    66564.421924
Name: BasePay, dtype: float64

Year
2011    63595.956517
2012    65436.406857
2013    69630.030216
2014    66564.421924
Name: BasePay, dtype: float64

__Ile jest unikalnych nazw zawodowych?__

In [52]:
len(pd.unique(DataFrame['JobTitle']))

2159

2159

__Jakie jest TOP 8 najczęstszych prac?__

In [53]:
DataFrame['JobTitle'].value_counts().head(8)

Transit Operator                7036
Special Nurse                   4389
Registered Nurse                3736
Public Svc Aide-Public Works    2518
Police Officer 3                2421
Custodian                       2418
TRANSIT OPERATOR                2388
Firefighter                     2359
Name: JobTitle, dtype: int64

Transit Operator                7036
Special Nurse                   4389
Registered Nurse                3736
Public Svc Aide-Public Works    2518
Police Officer 3                2421
Custodian                       2418
TRANSIT OPERATOR                2388
Firefighter                     2359
Name: JobTitle, dtype: int64

__Ile tytułów zawodowych reprezentowała tylko jedna osoba w 2013 r.?__

In [83]:
sum(DataFrame['JobTitle'][DataFrame['Year']==2013].value_counts() == 1)

202

In [84]:
DataFrame.head()

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.00,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN
1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,245131.88,137811.38,NaN,538909.28,538909.28,2011,NaN,San Francisco,NaN
2,3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739.13,106088.18,16452.60,NaN,335279.91,335279.91,2011,NaN,San Francisco,NaN
3,4,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916.00,56120.71,198306.90,NaN,332343.61,332343.61,2011,NaN,San Francisco,NaN
4,5,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134401.60,9737.00,182234.59,NaN,326373.19,326373.19,2011,NaN,San Francisco,NaN

__Ile ludzi ma słowo Chief w ich nazwie pracy? (Jest to dość trudne, hint: napisać funkcję + apply)__

In [117]:
def lower_string(title):
    return 'chief' in title.lower().split()

In [118]:
lower_string("DEPUTY MASTERCHIEFF OF DEPARTMENT,(FIRE DEPARTMENT)")

False

In [120]:
DataFrame['JobTitle'].apply(lambda x:lower_string(x))

0         False
1         False
2         False
3         False
4          True
          ...
148649    False
148650    False
148651    False
148652    False
148653    False
Name: JobTitle, Length: 148654, dtype: bool

In [122]:
sum(DataFrame['JobTitle'].apply(lambda jobtitle:'chief' in jobtitle.lower().split())) # one line lamba analizuje Dataframe row by row i przekazuje wartość.

477

In [ ]:
sum(DataFrame['JobTitle'].apply(lambda x:lower_string(x)))

477

__Czy występuje korelacja pomiedzy długością nazwy pracy a jej zarobkami?__

In [125]:
DataFrame['title_len'] = DataFrame['JobTitle'].apply(lambda dlugosc: len(dlugosc))

In [127]:
DataFrame.head()

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status,title_len
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.00,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN,46
1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,245131.88,137811.38,NaN,538909.28,538909.28,2011,NaN,San Francisco,NaN,31
2,3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739.13,106088.18,16452.60,NaN,335279.91,335279.91,2011,NaN,San Francisco,NaN,31
3,4,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916.00,56120.71,198306.90,NaN,332343.61,332343.61,2011,NaN,San Francisco,NaN,36
4,5,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134401.60,9737.00,182234.59,NaN,326373.19,326373.19,2011,NaN,San Francisco,NaN,44

Wniosek: Długość nazwy nie koreluje z wypłatą !!!

In [129]:
DataFrame[['TotalPayBenefits','title_len']].corr() # im bliżej 1 tym wartości bardziej skorelowane albo -1 albo 1 nie ma znaczenia znak

                  TotalPayBenefits  title_len
TotalPayBenefits          1.000000  -0.036878
title_len                -0.036878   1.000000

                  TotalPayBenefits  title_len
TotalPayBenefits          1.000000  -0.036878
title_len                -0.036878   1.000000